imbluedabr/m33mu/cpu/mcxn947/mcxn947_romapi.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "mcxn947/mcxn947_romapi.h"
#include "mcxn947/mcxn947_secure.h"

#define ROMAPI_BASE 0x1303fc00u
#define ROMAPI_SIZE 0x200u

#define ROMAPI_TREE_OFFSET 0x000u
#define ROMAPI_FLASH_DRV_OFFSET 0x040u
#define ROMAPI_NBOOT_DRV_OFFSET 0x0a0u
#define ROMAPI_FLEXSPI_DRV_OFFSET 0x0c0u
#define ROMAPI_EFUSE_DRV_OFFSET 0x100u
#define ROMAPI_IAP_DRV_OFFSET 0x120u

#define ROMAPI_STUB_BASE 0x1303f000u
#define ROMAPI_STUB_RUN_BOOTLOADER       (ROMAPI_STUB_BASE + 0x000u)
#define ROMAPI_STUB_FLASH_INIT           (ROMAPI_STUB_BASE + 0x010u)
#define ROMAPI_STUB_FLASH_DEINIT         (ROMAPI_STUB_BASE + 0x020u)
#define ROMAPI_STUB_FLASH_ERASE          (ROMAPI_STUB_BASE + 0x030u)
#define ROMAPI_STUB_FLASH_PROGRAM        (ROMAPI_STUB_BASE + 0x040u)
#define ROMAPI_STUB_FLASH_VERIFY_ERASE   (ROMAPI_STUB_BASE + 0x050u)
#define ROMAPI_STUB_FLASH_VERIFY_PROGRAM (ROMAPI_STUB_BASE + 0x060u)
#define ROMAPI_STUB_FLASH_GET_PROPERTY   (ROMAPI_STUB_BASE + 0x070u)
#define ROMAPI_STUB_FLASH_READ           (ROMAPI_STUB_BASE + 0x080u)
#define ROMAPI_STUB_FLASH_GET_CUST_KEYSTORE (ROMAPI_STUB_BASE + 0x090u)

#define ROMAPI_STUB_FFR_INIT             (ROMAPI_STUB_BASE + 0x0a0u)
#define ROMAPI_STUB_FFR_LOCK             (ROMAPI_STUB_BASE + 0x0b0u)
#define ROMAPI_STUB_FFR_CUST_FACTORY_PAGE_WRITE (ROMAPI_STUB_BASE + 0x0c0u)
#define ROMAPI_STUB_FFR_GET_UUID         (ROMAPI_STUB_BASE + 0x0d0u)
#define ROMAPI_STUB_FFR_GET_CUSTOMER_DATA (ROMAPI_STUB_BASE + 0x0e0u)
#define ROMAPI_STUB_FFR_CUST_KEYSTORE_WRITE (ROMAPI_STUB_BASE + 0x0f0u)
#define ROMAPI_STUB_FFR_INFIELD_PAGE_WRITE (ROMAPI_STUB_BASE + 0x100u)
#define ROMAPI_STUB_FFR_GET_CUSTOMER_INFIELD_DATA (ROMAPI_STUB_BASE + 0x110u)

#define ROMAPI_STUB_FLEXSPI_INIT         (ROMAPI_STUB_BASE + 0x120u)
#define ROMAPI_STUB_FLEXSPI_PAGE_PROGRAM (ROMAPI_STUB_BASE + 0x130u)
#define ROMAPI_STUB_FLEXSPI_ERASE_ALL    (ROMAPI_STUB_BASE + 0x140u)
#define ROMAPI_STUB_FLEXSPI_ERASE        (ROMAPI_STUB_BASE + 0x150u)
#define ROMAPI_STUB_FLEXSPI_ERASE_SECTOR (ROMAPI_STUB_BASE + 0x160u)
#define ROMAPI_STUB_FLEXSPI_ERASE_BLOCK  (ROMAPI_STUB_BASE + 0x170u)
#define ROMAPI_STUB_FLEXSPI_GET_CONFIG   (ROMAPI_STUB_BASE + 0x180u)
#define ROMAPI_STUB_FLEXSPI_READ         (ROMAPI_STUB_BASE + 0x190u)
#define ROMAPI_STUB_FLEXSPI_XFER         (ROMAPI_STUB_BASE + 0x1a0u)
#define ROMAPI_STUB_FLEXSPI_UPDATE_LUT   (ROMAPI_STUB_BASE + 0x1b0u)
#define ROMAPI_STUB_FLEXSPI_SET_CLOCK_SOURCE (ROMAPI_STUB_BASE + 0x1c0u)
#define ROMAPI_STUB_FLEXSPI_CONFIG_CLOCK (ROMAPI_STUB_BASE + 0x1d0u)
#define ROMAPI_STUB_FLEXSPI_PARTIAL_PROGRAM (ROMAPI_STUB_BASE + 0x1e0u)

#define ROMAPI_STUB_EFUSE_INIT           (ROMAPI_STUB_BASE + 0x1f0u)
#define ROMAPI_STUB_EFUSE_DEINIT         (ROMAPI_STUB_BASE + 0x200u)
#define ROMAPI_STUB_EFUSE_READ           (ROMAPI_STUB_BASE + 0x210u)
#define ROMAPI_STUB_EFUSE_PROGRAM        (ROMAPI_STUB_BASE + 0x220u)

#define ROMAPI_STUB_IAP_API_INIT         (ROMAPI_STUB_BASE + 0x230u)
#define ROMAPI_STUB_IAP_API_DEINIT       (ROMAPI_STUB_BASE + 0x240u)
#define ROMAPI_STUB_IAP_MEM_INIT         (ROMAPI_STUB_BASE + 0x250u)
#define ROMAPI_STUB_IAP_MEM_READ         (ROMAPI_STUB_BASE + 0x260u)
#define ROMAPI_STUB_IAP_MEM_WRITE        (ROMAPI_STUB_BASE + 0x270u)
#define ROMAPI_STUB_IAP_MEM_FILL         (ROMAPI_STUB_BASE + 0x280u)
#define ROMAPI_STUB_IAP_MEM_FLUSH        (ROMAPI_STUB_BASE + 0x290u)
#define ROMAPI_STUB_IAP_MEM_ERASE        (ROMAPI_STUB_BASE + 0x2a0u)
#define ROMAPI_STUB_IAP_MEM_CONFIG       (ROMAPI_STUB_BASE + 0x2b0u)
#define ROMAPI_STUB_IAP_MEM_ERASE_ALL    (ROMAPI_STUB_BASE + 0x2c0u)
#define ROMAPI_STUB_IAP_SBLOADER_INIT    (ROMAPI_STUB_BASE + 0x2d0u)
#define ROMAPI_STUB_IAP_SBLOADER_PUMP    (ROMAPI_STUB_BASE + 0x2e0u)
#define ROMAPI_STUB_IAP_SBLOADER_FINALIZE (ROMAPI_STUB_BASE + 0x2f0u)

#define ROMAPI_STUB_NBOOT_RNG            (ROMAPI_STUB_BASE + 0x300u)
#define ROMAPI_STUB_NBOOT_CONTEXT_INIT   (ROMAPI_STUB_BASE + 0x310u)
#define ROMAPI_STUB_NBOOT_CONTEXT_DEINIT (ROMAPI_STUB_BASE + 0x320u)
#define ROMAPI_STUB_NBOOT_SB3_LOAD_MANIFEST (ROMAPI_STUB_BASE + 0x330u)
#define ROMAPI_STUB_NBOOT_SB3_LOAD_BLOCK (ROMAPI_STUB_BASE + 0x340u)
#define ROMAPI_STUB_NBOOT_AUTH_ECDSA     (ROMAPI_STUB_BASE + 0x350u)
#define ROMAPI_STUB_NBOOT_AUTH_CMAC      (ROMAPI_STUB_BASE + 0x360u)

#define ROMAPI_PTR(addr) ((mm_u32)(addr) | 1u)
#define ROMAPI_STD_VERSION(name, major, minor, bugfix) \
    ((mm_u32)(bugfix) | ((mm_u32)(minor) << 8u) | ((mm_u32)(major) << 16u) | ((mm_u32)(name) << 24u))

#define ROMAPI_PFLASH_START 0x00000000u
#define ROMAPI_PFLASH_TOTAL_SIZE 0x00200000u
#define ROMAPI_PFLASH_BLOCK_SIZE 0x00100000u
#define ROMAPI_PFLASH_BLOCK_COUNT 2u
#define ROMAPI_PFLASH_SECTOR_SIZE 0x00002000u
#define ROMAPI_PFLASH_PAGE_SIZE 128u
#define ROMAPI_SYS_FREQ_HZ 150000000u

#define ROMAPI_FLASH_CONFIG_PFLASH_BLOCK_BASE 0x00u
#define ROMAPI_FLASH_CONFIG_PFLASH_TOTAL_SIZE 0x04u
#define ROMAPI_FLASH_CONFIG_PFLASH_BLOCK_COUNT 0x08u
#define ROMAPI_FLASH_CONFIG_PFLASH_PAGE_SIZE 0x0cu
#define ROMAPI_FLASH_CONFIG_PFLASH_SECTOR_SIZE 0x10u
#define ROMAPI_FLASH_CONFIG_FFR_BASE 0x14u
#define ROMAPI_FLASH_CONFIG_FFR_TOTAL_SIZE 0x18u
#define ROMAPI_FLASH_CONFIG_FFR_PAGE_SIZE 0x1cu
#define ROMAPI_FLASH_CONFIG_FFR_SECTOR_SIZE 0x20u
#define ROMAPI_FLASH_CONFIG_FFR_CFPA_VERSION 0x24u
#define ROMAPI_FLASH_CONFIG_FFR_CFPA_OFFSET 0x28u
#define ROMAPI_FLASH_CONFIG_MODE_SYS_FREQ_MHZ 0x2cu
#define ROMAPI_FLASH_CONFIG_MODE_READ_SINGLE_WORD 0x30u
#define ROMAPI_FLASH_CONFIG_MODE_SET_WRITE 0x34u
#define ROMAPI_FLASH_CONFIG_MODE_SET_READ 0x38u
#define ROMAPI_FLASH_CONFIG_NBOOT_CTX 0x40u
#define ROMAPI_FLASH_CONFIG_USE_AHB_READ 0x44u

#define ROMAPI_FLASH_ERASE_KEY 0x6b65666cu

#define ROMAPI_STATUS_FLASH_SUCCESS 0u
#define ROMAPI_STATUS_FLASH_INVALID_ARGUMENT 4u
#define ROMAPI_STATUS_FLASH_ADDRESS_ERROR 102u
#define ROMAPI_STATUS_FLASH_ACCESS_ERROR 103u
#define ROMAPI_STATUS_FLASH_ERASE_KEY_ERROR 107u
#define ROMAPI_STATUS_FLASH_COMPARE_ERROR 117u
#define ROMAPI_STATUS_FLASH_UNKNOWN_PROPERTY 106u

#define ROMAPI_STATUS_MEM_SUCCESS 0u
#define ROMAPI_STATUS_MEM_READ_FAILED 10201u
#define ROMAPI_STATUS_MEM_WRITE_FAILED 10202u
#define ROMAPI_STATUS_MEM_UNSUPPORTED 10214u

