imbluedabr/m33mu/cpu/mcxn947/mcxn947_romapi.c
#define ROMAPI_NBOOT_SUCCESS 0x5A5A5A5Au
#define ROMAPI_NBOOT_TRUE 0x3C5AC33Cu

static mm_u8 romapi_buf[ROMAPI_SIZE];
static mm_bool romapi_active = MM_FALSE;
static mm_bool romapi_trace = MM_FALSE;

static void romapi_trace_init(void)
{
    const char *env = getenv("M33MU_ROMAPI_TRACE");
    romapi_trace = (env != 0 && env[0] != '\0' && strcmp(env, "0") != 0) ? MM_TRUE : MM_FALSE;
}

static void romapi_write32(mm_u32 offset, mm_u32 value)
{
    if (offset + 4u > ROMAPI_SIZE) return;
    romapi_buf[offset] = (mm_u8)(value & 0xffu);
    romapi_buf[offset + 1u] = (mm_u8)((value >> 8u) & 0xffu);
    romapi_buf[offset + 2u] = (mm_u8)((value >> 16u) & 0xffu);
    romapi_buf[offset + 3u] = (mm_u8)((value >> 24u) & 0xffu);
}

static mm_bool romapi_read_region(mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    mm_u32 v = 0u;
    mm_u32 i;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if (offset + size_bytes > ROMAPI_SIZE) return MM_FALSE;
    for (i = 0; i < size_bytes; ++i) {
        v |= ((mm_u32)romapi_buf[offset + i]) << (8u * i);
    }
    *value_out = v;
    return MM_TRUE;
}

static void romapi_build_table(void)
{
    mm_u32 off;
    memset(romapi_buf, 0, sizeof(romapi_buf));

    romapi_write32(ROMAPI_TREE_OFFSET + 0x00u, ROMAPI_PTR(ROMAPI_STUB_RUN_BOOTLOADER));
    romapi_write32(ROMAPI_TREE_OFFSET + 0x04u, ROMAPI_STD_VERSION('B', 1u, 0u, 0u));
    romapi_write32(ROMAPI_TREE_OFFSET + 0x08u, 0u);
    romapi_write32(ROMAPI_TREE_OFFSET + 0x0cu, 0u);
    romapi_write32(ROMAPI_TREE_OFFSET + 0x10u, ROMAPI_BASE + ROMAPI_FLASH_DRV_OFFSET);
    romapi_write32(ROMAPI_TREE_OFFSET + 0x28u, ROMAPI_BASE + ROMAPI_NBOOT_DRV_OFFSET);
    romapi_write32(ROMAPI_TREE_OFFSET + 0x2cu, ROMAPI_BASE + ROMAPI_FLEXSPI_DRV_OFFSET);
    romapi_write32(ROMAPI_TREE_OFFSET + 0x30u, ROMAPI_BASE + ROMAPI_EFUSE_DRV_OFFSET);
    romapi_write32(ROMAPI_TREE_OFFSET + 0x34u, ROMAPI_BASE + ROMAPI_IAP_DRV_OFFSET);

    off = ROMAPI_FLASH_DRV_OFFSET;
    romapi_write32(off + 0x00u, ROMAPI_STD_VERSION('F', 1u, 0u, 0u));
    romapi_write32(off + 0x04u, ROMAPI_PTR(ROMAPI_STUB_FLASH_INIT));
    romapi_write32(off + 0x08u, ROMAPI_PTR(ROMAPI_STUB_FLASH_ERASE));
    romapi_write32(off + 0x0cu, ROMAPI_PTR(ROMAPI_STUB_FLASH_PROGRAM));
    romapi_write32(off + 0x10u, ROMAPI_PTR(ROMAPI_STUB_FLASH_VERIFY_ERASE));
    romapi_write32(off + 0x14u, ROMAPI_PTR(ROMAPI_STUB_FLASH_VERIFY_PROGRAM));
    romapi_write32(off + 0x18u, ROMAPI_PTR(ROMAPI_STUB_FLASH_GET_PROPERTY));
    romapi_write32(off + 0x28u, ROMAPI_PTR(ROMAPI_STUB_FFR_INIT));
    romapi_write32(off + 0x2cu, ROMAPI_PTR(ROMAPI_STUB_FFR_LOCK));
    romapi_write32(off + 0x30u, ROMAPI_PTR(ROMAPI_STUB_FFR_CUST_FACTORY_PAGE_WRITE));
    romapi_write32(off + 0x34u, ROMAPI_PTR(ROMAPI_STUB_FFR_GET_UUID));
    romapi_write32(off + 0x38u, ROMAPI_PTR(ROMAPI_STUB_FFR_GET_CUSTOMER_DATA));
    romapi_write32(off + 0x3cu, ROMAPI_PTR(ROMAPI_STUB_FFR_CUST_KEYSTORE_WRITE));
    romapi_write32(off + 0x48u, ROMAPI_PTR(ROMAPI_STUB_FFR_INFIELD_PAGE_WRITE));
    romapi_write32(off + 0x4cu, ROMAPI_PTR(ROMAPI_STUB_FFR_GET_CUSTOMER_INFIELD_DATA));
    romapi_write32(off + 0x50u, ROMAPI_PTR(ROMAPI_STUB_FLASH_READ));
    romapi_write32(off + 0x58u, ROMAPI_PTR(ROMAPI_STUB_FLASH_GET_CUST_KEYSTORE));
    romapi_write32(off + 0x5cu, ROMAPI_PTR(ROMAPI_STUB_FLASH_DEINIT));

    off = ROMAPI_NBOOT_DRV_OFFSET;
    romapi_write32(off + 0x00u, ROMAPI_PTR(ROMAPI_STUB_NBOOT_RNG));
    romapi_write32(off + 0x04u, ROMAPI_PTR(ROMAPI_STUB_NBOOT_CONTEXT_INIT));
    romapi_write32(off + 0x08u, ROMAPI_PTR(ROMAPI_STUB_NBOOT_CONTEXT_DEINIT));
    romapi_write32(off + 0x0cu, ROMAPI_PTR(ROMAPI_STUB_NBOOT_SB3_LOAD_MANIFEST));
    romapi_write32(off + 0x10u, ROMAPI_PTR(ROMAPI_STUB_NBOOT_SB3_LOAD_BLOCK));
    romapi_write32(off + 0x14u, ROMAPI_PTR(ROMAPI_STUB_NBOOT_AUTH_ECDSA));
    romapi_write32(off + 0x18u, ROMAPI_PTR(ROMAPI_STUB_NBOOT_AUTH_CMAC));

    off = ROMAPI_FLEXSPI_DRV_OFFSET;
    romapi_write32(off + 0x00u, ROMAPI_STD_VERSION('S', 1u, 0u, 0u));
    romapi_write32(off + 0x04u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_INIT));
    romapi_write32(off + 0x08u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_PAGE_PROGRAM));
    romapi_write32(off + 0x0cu, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_ERASE_ALL));
    romapi_write32(off + 0x10u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_ERASE));
    romapi_write32(off + 0x14u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_ERASE_SECTOR));
    romapi_write32(off + 0x18u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_ERASE_BLOCK));
    romapi_write32(off + 0x1cu, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_GET_CONFIG));
    romapi_write32(off + 0x20u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_READ));
    romapi_write32(off + 0x24u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_XFER));
    romapi_write32(off + 0x28u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_UPDATE_LUT));
    romapi_write32(off + 0x2cu, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_SET_CLOCK_SOURCE));
    romapi_write32(off + 0x30u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_CONFIG_CLOCK));
    romapi_write32(off + 0x34u, ROMAPI_PTR(ROMAPI_STUB_FLEXSPI_PARTIAL_PROGRAM));

    off = ROMAPI_EFUSE_DRV_OFFSET;
    romapi_write32(off + 0x00u, ROMAPI_STD_VERSION('E', 1u, 0u, 0u));
    romapi_write32(off + 0x04u, ROMAPI_PTR(ROMAPI_STUB_EFUSE_INIT));
    romapi_write32(off + 0x08u, ROMAPI_PTR(ROMAPI_STUB_EFUSE_DEINIT));
    romapi_write32(off + 0x0cu, ROMAPI_PTR(ROMAPI_STUB_EFUSE_READ));
    romapi_write32(off + 0x10u, ROMAPI_PTR(ROMAPI_STUB_EFUSE_PROGRAM));

    off = ROMAPI_IAP_DRV_OFFSET;
    romapi_write32(off + 0x00u, ROMAPI_STD_VERSION('I', 1u, 0u, 0u));
    romapi_write32(off + 0x04u, ROMAPI_PTR(ROMAPI_STUB_IAP_API_INIT));
    romapi_write32(off + 0x08u, ROMAPI_PTR(ROMAPI_STUB_IAP_API_DEINIT));
    romapi_write32(off + 0x0cu, ROMAPI_PTR(ROMAPI_STUB_IAP_MEM_INIT));
    romapi_write32(off + 0x10u, ROMAPI_PTR(ROMAPI_STUB_IAP_MEM_READ));
    romapi_write32(off + 0x14u, ROMAPI_PTR(ROMAPI_STUB_IAP_MEM_WRITE));
    romapi_write32(off + 0x18u, ROMAPI_PTR(ROMAPI_STUB_IAP_MEM_FILL));
    romapi_write32(off + 0x1cu, ROMAPI_PTR(ROMAPI_STUB_IAP_MEM_FLUSH));
    romapi_write32(off + 0x20u, ROMAPI_PTR(ROMAPI_STUB_IAP_MEM_ERASE));
    romapi_write32(off + 0x24u, ROMAPI_PTR(ROMAPI_STUB_IAP_MEM_CONFIG));
    romapi_write32(off + 0x28u, ROMAPI_PTR(ROMAPI_STUB_IAP_MEM_ERASE_ALL));
    romapi_write32(off + 0x2cu, ROMAPI_PTR(ROMAPI_STUB_IAP_SBLOADER_INIT));
    romapi_write32(off + 0x30u, ROMAPI_PTR(ROMAPI_STUB_IAP_SBLOADER_PUMP));
    romapi_write32(off + 0x34u, ROMAPI_PTR(ROMAPI_STUB_IAP_SBLOADER_FINALIZE));
}

static mm_bool romapi_write_mem32(struct mm_memmap *map, enum mm_sec_state sec, mm_u32 addr, mm_u32 value)
{
    return mm_memmap_write(map, sec, addr, 4u, value);
}

static mm_u32 romapi_read32le_buf(const mm_u8 *buf)
{
    return ((mm_u32)buf[0]) |
           ((mm_u32)buf[1] << 8u) |
           ((mm_u32)buf[2] << 16u) |
           ((mm_u32)buf[3] << 24u);
}

static mm_bool romapi_flash_offset(const struct mm_memmap *map, mm_u32 addr, mm_u32 len, mm_u32 *offset_out)
{
    mm_u32 base;
    mm_u32 size_limit;
    if (map == 0 || offset_out == 0) return MM_FALSE;
    base = map->flash_base_s;
    size_limit = map->flash_size_s;
    if (size_limit == 0u && map->flash.length > 0u) {
        base = map->flash.base;
        size_limit = (mm_u32)map->flash.length;
    }
    if (addr >= base && (addr - base) + len <= size_limit) {
        *offset_out = addr - base;
        return MM_TRUE;
    }
    base = map->flash_base_ns;
    size_limit = map->flash_size_ns;
    if (size_limit == 0u && map->flash.length > 0u) {
        base = map->flash.base;
        size_limit = (mm_u32)map->flash.length;
    }
    if (addr >= base && (addr - base) + len <= size_limit) {
        *offset_out = addr - base;
        return MM_TRUE;
    }
    return MM_FALSE;
}

