imbluedabr/m33mu/cpu/mcxn947/mcxn947_romapi.c
static mm_bool romapi_flash_write_raw(struct mm_memmap *map, mm_u32 addr, mm_u8 value)
{
    mm_u32 offset;
    mm_u8 *buf;
    if (map == 0 || map->flash.buffer == 0) return MM_FALSE;
    if (!romapi_flash_offset(map, addr, 1u, &offset)) return MM_FALSE;
    buf = (mm_u8 *)map->flash.buffer;
    buf[offset] = value;
    return MM_TRUE;
}

static mm_bool romapi_write_mem8(struct mm_memmap *map, enum mm_sec_state sec, mm_u32 addr, mm_u8 value)
{
    if (mm_memmap_write8(map, sec, addr, value)) return MM_TRUE;
    return romapi_flash_write_raw(map, addr, value);
}

static mm_bool romapi_read_mem8(const struct mm_memmap *map, enum mm_sec_state sec, mm_u32 addr, mm_u8 *value_out)
{
    return mm_memmap_read8(map, sec, addr, value_out);
}

static mm_bool romapi_memcpy_from_map(const struct mm_memmap *map, enum mm_sec_state sec,
                                      mm_u32 dst, mm_u32 src, mm_u32 len, struct mm_memmap *wmap)
{
    mm_u32 i;
    mm_u8 b;
    if (map == 0 || wmap == 0) return MM_FALSE;
    for (i = 0; i < len; ++i) {
        if (!romapi_read_mem8(map, sec, src + i, &b)) return MM_FALSE;
        if (!romapi_write_mem8(wmap, sec, dst + i, b)) return MM_FALSE;
    }
    return MM_TRUE;
}

static mm_bool romapi_memset_map(struct mm_memmap *map, enum mm_sec_state sec, mm_u32 dst, mm_u8 value, mm_u32 len)
{
    mm_u32 i;
    if (map == 0) return MM_FALSE;
    for (i = 0; i < len; ++i) {
        if (!romapi_write_mem8(map, sec, dst + i, value)) return MM_FALSE;
    }
    return MM_TRUE;
}

static mm_bool romapi_get_stack_u32(struct mm_cpu *cpu, struct mm_memmap *map, mm_u32 index, mm_u32 *value_out)
{
    mm_u32 sp;
    if (cpu == 0 || map == 0 || value_out == 0) return MM_FALSE;
    sp = cpu->r[13];
    return mm_memmap_read(map, cpu->sec_state, sp + index * 4u, 4u, value_out);
}

static mm_bool romapi_flash_base_size(const struct mm_memmap *map, mm_u32 *base_out, mm_u32 *size_out)
{
    if (map == 0 || base_out == 0 || size_out == 0) return MM_FALSE;
    if (map->flash_size_s != 0u) {
        *base_out = map->flash_base_s;
        *size_out = map->flash_size_s;
        return MM_TRUE;
    }
    if (map->flash.length > 0u) {
        *base_out = map->flash.base;
        *size_out = (mm_u32)map->flash.length;
        return MM_TRUE;
    }
    if (map->flash_size_ns != 0u) {
        *base_out = map->flash_base_ns;
        *size_out = map->flash_size_ns;
        return MM_TRUE;
    }
    return MM_FALSE;
}

static void romapi_return(struct mm_cpu *cpu)
{
    if (cpu == 0) return;
    cpu->r[15] = cpu->r[14];
}

static mm_u32 romapi_flash_init(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 cfg;
    enum mm_sec_state sec;
    mm_bool ok = MM_TRUE;
    if (cpu == 0 || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    cfg = cpu->r[0];
    if (cfg == 0u) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    sec = cpu->sec_state;
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_PFLASH_BLOCK_BASE, ROMAPI_PFLASH_START);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_PFLASH_TOTAL_SIZE, ROMAPI_PFLASH_TOTAL_SIZE);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_PFLASH_BLOCK_COUNT, ROMAPI_PFLASH_BLOCK_COUNT);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_PFLASH_PAGE_SIZE, ROMAPI_PFLASH_PAGE_SIZE);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_PFLASH_SECTOR_SIZE, ROMAPI_PFLASH_SECTOR_SIZE);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_FFR_BASE, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_FFR_TOTAL_SIZE, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_FFR_PAGE_SIZE, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_FFR_SECTOR_SIZE, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_FFR_CFPA_VERSION, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_FFR_CFPA_OFFSET, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_MODE_SYS_FREQ_MHZ, ROMAPI_SYS_FREQ_HZ / 1000000u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_MODE_READ_SINGLE_WORD, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_MODE_SET_WRITE, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_MODE_SET_READ, 0u);
    ok &= romapi_write_mem32(map, sec, cfg + ROMAPI_FLASH_CONFIG_NBOOT_CTX, 0u);
    ok &= romapi_write_mem8(map, sec, cfg + ROMAPI_FLASH_CONFIG_USE_AHB_READ, 1u);
    if (!ok) return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static mm_u32 romapi_flash_get_property(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 which;
    mm_u32 out;
    mm_u32 val = 0u;
    if (cpu == 0 || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    which = cpu->r[1];
    out = cpu->r[2];
    if (out == 0u) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    switch (which) {
    case 0x00u: val = ROMAPI_PFLASH_SECTOR_SIZE; break;
    case 0x01u: val = ROMAPI_PFLASH_TOTAL_SIZE; break;
    case 0x02u: val = ROMAPI_PFLASH_BLOCK_SIZE; break;
    case 0x03u: val = ROMAPI_PFLASH_BLOCK_COUNT; break;
    case 0x04u: val = ROMAPI_PFLASH_START; break;
    case 0x30u: val = ROMAPI_PFLASH_PAGE_SIZE; break;
    case 0x31u: val = ROMAPI_SYS_FREQ_HZ; break;
    case 0x40u:
    case 0x41u:
    case 0x42u:
    case 0x43u:
        val = 0u;
        break;
    default:
        return ROMAPI_STATUS_FLASH_UNKNOWN_PROPERTY;
    }
    if (!romapi_write_mem32(map, cpu->sec_state, out, val)) {
        return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    }
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static mm_u32 romapi_flash_read(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 start;
    mm_u32 dest;
    mm_u32 len;
    mm_u32 flash_off;
    if (cpu == 0 || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    start = cpu->r[1];
    dest = cpu->r[2];
    len = cpu->r[3];
    if (len == 0u) return ROMAPI_STATUS_FLASH_SUCCESS;
    if (!romapi_flash_offset(map, start, len, &flash_off)) {
        return ROMAPI_STATUS_FLASH_ADDRESS_ERROR;
    }
    if (!romapi_memcpy_from_map(map, cpu->sec_state, dest, start, len, map)) {
        return ROMAPI_STATUS_FLASH_ADDRESS_ERROR;
    }
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static mm_u32 romapi_flash_program(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 start;
    mm_u32 src;
    mm_u32 len;
    mm_u32 flash_off;
    if (cpu == 0 || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    start = cpu->r[1];
    src = cpu->r[2];
    len = cpu->r[3];
    if (len == 0u) return ROMAPI_STATUS_FLASH_SUCCESS;
    if (!romapi_flash_offset(map, start, len, &flash_off)) {
        return ROMAPI_STATUS_FLASH_ADDRESS_ERROR;
    }
    if (!romapi_memcpy_from_map(map, cpu->sec_state, start, src, len, map)) {
        return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    }
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static mm_u32 romapi_flash_erase(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 start;
    mm_u32 len;
    mm_u32 key;
    mm_u32 flash_off;
    if (cpu == 0 || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    start = cpu->r[1];
    len = cpu->r[2];
    key = cpu->r[3];
    if (key != ROMAPI_FLASH_ERASE_KEY) return ROMAPI_STATUS_FLASH_ERASE_KEY_ERROR;
    if (len == 0u) return ROMAPI_STATUS_FLASH_SUCCESS;
    if (!romapi_flash_offset(map, start, len, &flash_off)) {
        return ROMAPI_STATUS_FLASH_ADDRESS_ERROR;
    }
    if (!romapi_memset_map(map, cpu->sec_state, start, 0xffu, len)) {
        return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    }
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static mm_u32 romapi_flash_verify_erase(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 start;
    mm_u32 len;
    mm_u32 i;
    mm_u8 b;
    if (cpu == 0 || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    start = cpu->r[1];
    len = cpu->r[2];
    for (i = 0; i < len; ++i) {
        if (!romapi_read_mem8(map, cpu->sec_state, start + i, &b)) {
            return ROMAPI_STATUS_FLASH_ADDRESS_ERROR;
        }
        if (b != 0xffu) return ROMAPI_STATUS_FLASH_COMPARE_ERROR;
    }
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static mm_u32 romapi_flash_get_cust_keystore(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 out;
    mm_u32 len;
    if (cpu == 0 || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    out = cpu->r[1];
    len = cpu->r[3];
    if (out == 0u || len == 0u) return ROMAPI_STATUS_FLASH_SUCCESS;
    (void)romapi_memset_map(map, cpu->sec_state, out, 0u, len);
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static void romapi_nboot_set_true(struct mm_memmap *map, enum mm_sec_state sec, mm_u32 addr)
{
    if (addr == 0u || map == 0) return;
    (void)romapi_write_mem32(map, sec, addr, ROMAPI_NBOOT_TRUE);
}

