imbluedabr/m33mu/cpu/mcxn947/mcxn947_romapi.c
static void romapi_rng_fill(struct mm_memmap *map, enum mm_sec_state sec, mm_u32 addr, mm_u32 len)
{
    mm_u32 i;
    mm_u8 buf[32];
    mm_u32 chunk;
    mm_u32 j;
    if (map == 0) return;
    i = 0u;
    while (i < len) {
        chunk = len - i;
        if (chunk > sizeof(buf)) chunk = sizeof(buf);
        mm_mcxn947_secure_rng_fill(buf, chunk);
        for (j = 0u; j < chunk; ++j) {
            (void)romapi_write_mem8(map, sec, addr + i + j, buf[j]);
        }
        i += chunk;
    }
}

static mm_u32 romapi_secure_violation_status(mm_u32 pc)
{
    switch (pc) {
    case ROMAPI_STUB_NBOOT_RNG:
    case ROMAPI_STUB_NBOOT_CONTEXT_INIT:
    case ROMAPI_STUB_NBOOT_CONTEXT_DEINIT:
    case ROMAPI_STUB_NBOOT_SB3_LOAD_MANIFEST:
    case ROMAPI_STUB_NBOOT_SB3_LOAD_BLOCK:
    case ROMAPI_STUB_NBOOT_AUTH_ECDSA:
    case ROMAPI_STUB_NBOOT_AUTH_CMAC:
        return 1u;
    case ROMAPI_STUB_IAP_API_INIT:
    case ROMAPI_STUB_IAP_API_DEINIT:
    case ROMAPI_STUB_IAP_MEM_INIT:
    case ROMAPI_STUB_IAP_MEM_READ:
    case ROMAPI_STUB_IAP_MEM_WRITE:
    case ROMAPI_STUB_IAP_MEM_FILL:
    case ROMAPI_STUB_IAP_MEM_FLUSH:
    case ROMAPI_STUB_IAP_MEM_ERASE:
    case ROMAPI_STUB_IAP_MEM_CONFIG:
    case ROMAPI_STUB_IAP_MEM_ERASE_ALL:
    case ROMAPI_STUB_IAP_SBLOADER_INIT:
    case ROMAPI_STUB_IAP_SBLOADER_PUMP:
    case ROMAPI_STUB_IAP_SBLOADER_FINALIZE:
        return ROMAPI_STATUS_MEM_UNSUPPORTED;
    default:
        break;
    }
    return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
}

static mm_u32 romapi_uuid_fill(struct mm_memmap *map, enum mm_sec_state sec, mm_u32 addr)
{
    struct mcxn947_attestation_blob blob;
    if (addr == 0u || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    if (!mm_mcxn947_secure_attest(&blob)) return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    if (!romapi_write_mem32(map, sec, addr + 0u, romapi_read32le_buf(blob.pubkey + 0u))) return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    if (!romapi_write_mem32(map, sec, addr + 4u, romapi_read32le_buf(blob.pubkey + 4u))) return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    if (!romapi_write_mem32(map, sec, addr + 8u, romapi_read32le_buf(blob.pubkey + 8u))) return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    if (!romapi_write_mem32(map, sec, addr + 12u, romapi_read32le_buf(blob.pubkey + 12u))) return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static mm_u32 romapi_efuse_read(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 value;
    if (cpu == 0 || map == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    if (!mm_mcxn947_secure_otp_read(cpu->r[0], &value)) {
        return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    }
    if (cpu->r[1] != 0u && !romapi_write_mem32(map, cpu->sec_state, cpu->r[1], value)) {
        return ROMAPI_STATUS_FLASH_ACCESS_ERROR;
    }
    return ROMAPI_STATUS_FLASH_SUCCESS;
}

static mm_u32 romapi_efuse_program(struct mm_cpu *cpu)
{
    if (cpu == 0) return ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
    return mm_mcxn947_secure_otp_program(cpu->r[0], cpu->r[1]) ?
           ROMAPI_STATUS_FLASH_SUCCESS : ROMAPI_STATUS_FLASH_INVALID_ARGUMENT;
}

static mm_u32 romapi_iap_gate_status(mm_u32 pc)
{
    switch (pc) {
    case ROMAPI_STUB_IAP_API_INIT:
    case ROMAPI_STUB_IAP_MEM_INIT:
    case ROMAPI_STUB_IAP_SBLOADER_INIT:
    case ROMAPI_STUB_IAP_SBLOADER_PUMP:
    case ROMAPI_STUB_IAP_SBLOADER_FINALIZE:
        if (!mm_mcxn947_secure_els_clock_ready()) return ROMAPI_STATUS_MEM_UNSUPPORTED;
        break;
    default:
        break;
    }
    return ROMAPI_STATUS_MEM_SUCCESS;
}

static mm_u32 romapi_iap_mem_read(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 addr = cpu->r[1];
    mm_u32 len = cpu->r[2];
    mm_u32 buf = cpu->r[3];
    mm_u32 memory_id = 0u;
    mm_u32 flash_off;
    (void)romapi_get_stack_u32(cpu, map, 0u, &memory_id);
    if (len == 0u) return ROMAPI_STATUS_MEM_SUCCESS;
    if (memory_id != 0u && !romapi_flash_offset(map, addr, len, &flash_off)) {
        return ROMAPI_STATUS_MEM_UNSUPPORTED;
    }
    if (!romapi_memcpy_from_map(map, cpu->sec_state, buf, addr, len, map)) {
        return ROMAPI_STATUS_MEM_READ_FAILED;
    }
    return ROMAPI_STATUS_MEM_SUCCESS;
}

static mm_u32 romapi_iap_mem_write(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 addr = cpu->r[1];
    mm_u32 len = cpu->r[2];
    mm_u32 buf = cpu->r[3];
    mm_u32 memory_id = 0u;
    mm_u32 flash_off;
    (void)romapi_get_stack_u32(cpu, map, 0u, &memory_id);
    if (len == 0u) return ROMAPI_STATUS_MEM_SUCCESS;
    if (memory_id != 0u && !romapi_flash_offset(map, addr, len, &flash_off)) {
        return ROMAPI_STATUS_MEM_UNSUPPORTED;
    }
    if (!romapi_memcpy_from_map(map, cpu->sec_state, addr, buf, len, map)) {
        return ROMAPI_STATUS_MEM_WRITE_FAILED;
    }
    return ROMAPI_STATUS_MEM_SUCCESS;
}

static mm_u32 romapi_iap_mem_fill(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 addr = cpu->r[1];
    mm_u32 len = cpu->r[2];
    mm_u32 pattern = cpu->r[3];
    mm_u32 memory_id = 0u;
    mm_u32 flash_off;
    (void)romapi_get_stack_u32(cpu, map, 0u, &memory_id);
    if (len == 0u) return ROMAPI_STATUS_MEM_SUCCESS;
    if (memory_id != 0u && !romapi_flash_offset(map, addr, len, &flash_off)) {
        return ROMAPI_STATUS_MEM_UNSUPPORTED;
    }
    if (!romapi_memset_map(map, cpu->sec_state, addr, (mm_u8)(pattern & 0xffu), len)) {
        return ROMAPI_STATUS_MEM_WRITE_FAILED;
    }
    return ROMAPI_STATUS_MEM_SUCCESS;
}

static mm_u32 romapi_iap_mem_erase(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 addr = cpu->r[1];
    mm_u32 len = cpu->r[2];
    mm_u32 memory_id = cpu->r[3];
    mm_u32 flash_off;
    if (len == 0u) return ROMAPI_STATUS_MEM_SUCCESS;
    if (memory_id != 0u && !romapi_flash_offset(map, addr, len, &flash_off)) {
        return ROMAPI_STATUS_MEM_UNSUPPORTED;
    }
    if (!romapi_memset_map(map, cpu->sec_state, addr, 0xffu, len)) {
        return ROMAPI_STATUS_MEM_WRITE_FAILED;
    }
    return ROMAPI_STATUS_MEM_SUCCESS;
}

static mm_u32 romapi_iap_mem_erase_all(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 memory_id = cpu->r[1];
    mm_u32 base;
    mm_u32 size;
    if (memory_id != 0u) return ROMAPI_STATUS_MEM_UNSUPPORTED;
    if (!romapi_flash_base_size(map, &base, &size)) return ROMAPI_STATUS_MEM_UNSUPPORTED;
    if (size == 0u) return ROMAPI_STATUS_MEM_SUCCESS;
    if (!romapi_memset_map(map, cpu->sec_state, base, 0xffu, size)) {
        return ROMAPI_STATUS_MEM_WRITE_FAILED;
    }
    return ROMAPI_STATUS_MEM_SUCCESS;
}

