imbluedabr/m33mu/cpu/mcxn947/mcxn947_romapi.c
static mm_bool mcxn947_romapi_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    mm_bool ok;
    (void)opaque;
    ok = romapi_read_region(offset, size_bytes, value_out);
    if (romapi_trace && ok) {
        printf("[ROMAPI] read addr=0x%08lx size=%lu value=0x%08lx\n",
               (unsigned long)(ROMAPI_BASE + offset),
               (unsigned long)size_bytes,
               (unsigned long)(value_out ? *value_out : 0u));
    }
    return ok;
}

static mm_bool mcxn947_romapi_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    (void)opaque;
    (void)offset;
    (void)size_bytes;
    (void)value;
    return MM_TRUE;
}

static const char *romapi_stub_name(mm_u32 pc)
{
    switch (pc) {
    case ROMAPI_STUB_RUN_BOOTLOADER: return "runBootloader";
    case ROMAPI_STUB_FLASH_INIT: return "flash_init";
    case ROMAPI_STUB_FLASH_DEINIT: return "flash_deinit";
    case ROMAPI_STUB_FLASH_ERASE: return "flash_erase";
    case ROMAPI_STUB_FLASH_PROGRAM: return "flash_program";
    case ROMAPI_STUB_FLASH_VERIFY_ERASE: return "flash_verify_erase";
    case ROMAPI_STUB_FLASH_VERIFY_PROGRAM: return "flash_verify_program";
    case ROMAPI_STUB_FLASH_GET_PROPERTY: return "flash_get_property";
    case ROMAPI_STUB_FLASH_READ: return "flash_read";
    case ROMAPI_STUB_FLASH_GET_CUST_KEYSTORE: return "flash_get_cust_keystore";
    case ROMAPI_STUB_FFR_INIT: return "ffr_init";
    case ROMAPI_STUB_FFR_LOCK: return "ffr_lock";
    case ROMAPI_STUB_FFR_CUST_FACTORY_PAGE_WRITE: return "ffr_cust_factory_page_write";
    case ROMAPI_STUB_FFR_GET_UUID: return "ffr_get_uuid";
    case ROMAPI_STUB_FFR_GET_CUSTOMER_DATA: return "ffr_get_customer_data";
    case ROMAPI_STUB_FFR_CUST_KEYSTORE_WRITE: return "ffr_cust_keystore_write";
    case ROMAPI_STUB_FFR_INFIELD_PAGE_WRITE: return "ffr_infield_page_write";
    case ROMAPI_STUB_FFR_GET_CUSTOMER_INFIELD_DATA: return "ffr_get_customer_infield_data";
    case ROMAPI_STUB_FLEXSPI_INIT: return "flexspi_init";
    case ROMAPI_STUB_FLEXSPI_PAGE_PROGRAM: return "flexspi_page_program";
    case ROMAPI_STUB_FLEXSPI_ERASE_ALL: return "flexspi_erase_all";
    case ROMAPI_STUB_FLEXSPI_ERASE: return "flexspi_erase";
    case ROMAPI_STUB_FLEXSPI_ERASE_SECTOR: return "flexspi_erase_sector";
    case ROMAPI_STUB_FLEXSPI_ERASE_BLOCK: return "flexspi_erase_block";
    case ROMAPI_STUB_FLEXSPI_GET_CONFIG: return "flexspi_get_config";
    case ROMAPI_STUB_FLEXSPI_READ: return "flexspi_read";
    case ROMAPI_STUB_FLEXSPI_XFER: return "flexspi_xfer";
    case ROMAPI_STUB_FLEXSPI_UPDATE_LUT: return "flexspi_update_lut";
    case ROMAPI_STUB_FLEXSPI_SET_CLOCK_SOURCE: return "flexspi_set_clock_source";
    case ROMAPI_STUB_FLEXSPI_CONFIG_CLOCK: return "flexspi_config_clock";
    case ROMAPI_STUB_FLEXSPI_PARTIAL_PROGRAM: return "flexspi_partial_program";
    case ROMAPI_STUB_EFUSE_INIT: return "efuse_init";
    case ROMAPI_STUB_EFUSE_DEINIT: return "efuse_deinit";
    case ROMAPI_STUB_EFUSE_READ: return "efuse_read";
    case ROMAPI_STUB_EFUSE_PROGRAM: return "efuse_program";
    case ROMAPI_STUB_IAP_API_INIT: return "iap_api_init";
    case ROMAPI_STUB_IAP_API_DEINIT: return "iap_api_deinit";
    case ROMAPI_STUB_IAP_MEM_INIT: return "iap_mem_init";
    case ROMAPI_STUB_IAP_MEM_READ: return "iap_mem_read";
    case ROMAPI_STUB_IAP_MEM_WRITE: return "iap_mem_write";
    case ROMAPI_STUB_IAP_MEM_FILL: return "iap_mem_fill";
    case ROMAPI_STUB_IAP_MEM_FLUSH: return "iap_mem_flush";
    case ROMAPI_STUB_IAP_MEM_ERASE: return "iap_mem_erase";
    case ROMAPI_STUB_IAP_MEM_CONFIG: return "iap_mem_config";
    case ROMAPI_STUB_IAP_MEM_ERASE_ALL: return "iap_mem_erase_all";
    case ROMAPI_STUB_IAP_SBLOADER_INIT: return "iap_sbloader_init";
    case ROMAPI_STUB_IAP_SBLOADER_PUMP: return "iap_sbloader_pump";
    case ROMAPI_STUB_IAP_SBLOADER_FINALIZE: return "iap_sbloader_finalize";
    case ROMAPI_STUB_NBOOT_RNG: return "nboot_rng_generate_random";
    case ROMAPI_STUB_NBOOT_CONTEXT_INIT: return "nboot_context_init";
    case ROMAPI_STUB_NBOOT_CONTEXT_DEINIT: return "nboot_context_deinit";
    case ROMAPI_STUB_NBOOT_SB3_LOAD_MANIFEST: return "nboot_sb3_load_manifest";
    case ROMAPI_STUB_NBOOT_SB3_LOAD_BLOCK: return "nboot_sb3_load_block";
    case ROMAPI_STUB_NBOOT_AUTH_ECDSA: return "nboot_img_authenticate_ecdsa";
    case ROMAPI_STUB_NBOOT_AUTH_CMAC: return "nboot_img_authenticate_cmac";
    default:
        break;
    }
    return 0;
}

mm_bool mm_mcxn947_romapi_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;
    if (bus == 0) return MM_FALSE;
    memset(&reg, 0, sizeof(reg));
    reg.base = ROMAPI_BASE;
    reg.size = ROMAPI_SIZE;
    reg.opaque = 0;
    reg.read = mcxn947_romapi_read;
    reg.write = mcxn947_romapi_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    romapi_active = MM_TRUE;
    romapi_trace_init();
    mm_mcxn947_romapi_reset();
    return MM_TRUE;
}

void mm_mcxn947_romapi_reset(void)
{
    if (!romapi_active) return;
    romapi_trace_init();
    romapi_build_table();
}

mm_bool mm_mcxn947_romapi_handle(struct mm_cpu *cpu, struct mm_memmap *map)
{
    mm_u32 pc;
    const char *name;
    if (!romapi_active || cpu == 0 || map == 0) return MM_FALSE;
    pc = cpu->r[15] & ~1u;
    name = romapi_stub_name(pc);
    if (romapi_trace && name != 0) {
        printf("[ROMAPI] call pc=0x%08lx fn=%s r0=0x%08lx r1=0x%08lx r2=0x%08lx r3=0x%08lx\n",
               (unsigned long)pc,
               name,
               (unsigned long)cpu->r[0],
               (unsigned long)cpu->r[1],
               (unsigned long)cpu->r[2],
               (unsigned long)cpu->r[3]);
    }
    if (!mm_mcxn947_secure_rom_call_allowed(cpu->sec_state)) {
        cpu->r[0] = romapi_secure_violation_status(pc);
        romapi_return(cpu);
        return MM_TRUE;
    }
    switch (pc) {
    case ROMAPI_STUB_RUN_BOOTLOADER:
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_INIT:
        cpu->r[0] = romapi_flash_init(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_DEINIT:
        cpu->r[0] = ROMAPI_STATUS_FLASH_SUCCESS;
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_ERASE:
        cpu->r[0] = romapi_flash_erase(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_PROGRAM:
        cpu->r[0] = romapi_flash_program(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_VERIFY_ERASE:
        cpu->r[0] = romapi_flash_verify_erase(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_VERIFY_PROGRAM:
        cpu->r[0] = ROMAPI_STATUS_FLASH_SUCCESS;
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_GET_PROPERTY:
        cpu->r[0] = romapi_flash_get_property(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_READ:
        cpu->r[0] = romapi_flash_read(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLASH_GET_CUST_KEYSTORE:
        cpu->r[0] = romapi_flash_get_cust_keystore(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FFR_INIT:
    case ROMAPI_STUB_FFR_LOCK:
    case ROMAPI_STUB_FFR_CUST_FACTORY_PAGE_WRITE:
    case ROMAPI_STUB_FFR_GET_CUSTOMER_DATA:
    case ROMAPI_STUB_FFR_CUST_KEYSTORE_WRITE:
    case ROMAPI_STUB_FFR_INFIELD_PAGE_WRITE:
    case ROMAPI_STUB_FFR_GET_CUSTOMER_INFIELD_DATA:
        cpu->r[0] = ROMAPI_STATUS_FLASH_SUCCESS;
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FFR_GET_UUID:
        cpu->r[0] = romapi_uuid_fill(map, cpu->sec_state, cpu->r[1]);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_FLEXSPI_INIT:
    case ROMAPI_STUB_FLEXSPI_PAGE_PROGRAM:
    case ROMAPI_STUB_FLEXSPI_ERASE_ALL:
    case ROMAPI_STUB_FLEXSPI_ERASE:
    case ROMAPI_STUB_FLEXSPI_ERASE_SECTOR:
    case ROMAPI_STUB_FLEXSPI_ERASE_BLOCK:
    case ROMAPI_STUB_FLEXSPI_GET_CONFIG:
    case ROMAPI_STUB_FLEXSPI_READ:
    case ROMAPI_STUB_FLEXSPI_XFER:
    case ROMAPI_STUB_FLEXSPI_UPDATE_LUT:
    case ROMAPI_STUB_FLEXSPI_SET_CLOCK_SOURCE:
    case ROMAPI_STUB_FLEXSPI_CONFIG_CLOCK:
    case ROMAPI_STUB_FLEXSPI_PARTIAL_PROGRAM:
        cpu->r[0] = ROMAPI_STATUS_FLASH_SUCCESS;
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_EFUSE_INIT:
    case ROMAPI_STUB_EFUSE_DEINIT:
        cpu->r[0] = ROMAPI_STATUS_FLASH_SUCCESS;
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_EFUSE_READ:
        cpu->r[0] = romapi_efuse_read(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_EFUSE_PROGRAM:
        cpu->r[0] = romapi_efuse_program(cpu);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_IAP_API_INIT:
    case ROMAPI_STUB_IAP_API_DEINIT:
    case ROMAPI_STUB_IAP_MEM_INIT:
    case ROMAPI_STUB_IAP_MEM_FLUSH:
    case ROMAPI_STUB_IAP_MEM_CONFIG:
    case ROMAPI_STUB_IAP_SBLOADER_INIT:
    case ROMAPI_STUB_IAP_SBLOADER_PUMP:
    case ROMAPI_STUB_IAP_SBLOADER_FINALIZE:
        cpu->r[0] = romapi_iap_gate_status(pc);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_IAP_MEM_READ:
        cpu->r[0] = romapi_iap_mem_read(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_IAP_MEM_WRITE:
        cpu->r[0] = romapi_iap_mem_write(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_IAP_MEM_FILL:
        cpu->r[0] = romapi_iap_mem_fill(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_IAP_MEM_ERASE:
        cpu->r[0] = romapi_iap_mem_erase(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_IAP_MEM_ERASE_ALL:
        cpu->r[0] = romapi_iap_mem_erase_all(cpu, map);
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_NBOOT_RNG:
        romapi_rng_fill(map, cpu->sec_state, cpu->r[0], cpu->r[1]);
        cpu->r[0] = ROMAPI_STATUS_FLASH_SUCCESS;
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_NBOOT_CONTEXT_INIT:
    case ROMAPI_STUB_NBOOT_CONTEXT_DEINIT:
        if (!mm_mcxn947_secure_els_clock_ready()) {
            cpu->r[0] = 1u;
            romapi_return(cpu);
            return MM_TRUE;
        }
        cpu->r[0] = ROMAPI_NBOOT_SUCCESS;
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_NBOOT_SB3_LOAD_MANIFEST:
    case ROMAPI_STUB_NBOOT_SB3_LOAD_BLOCK:
        if (!mm_mcxn947_secure_els_clock_ready()) {
            cpu->r[0] = 1u;
            cpu->r[1] = 1u;
            romapi_return(cpu);
            return MM_TRUE;
        }
        cpu->r[0] = ROMAPI_NBOOT_SUCCESS;
        cpu->r[1] = 0u;
        romapi_return(cpu);
        return MM_TRUE;
    case ROMAPI_STUB_NBOOT_AUTH_ECDSA:
    case ROMAPI_STUB_NBOOT_AUTH_CMAC:
        if (!mm_mcxn947_secure_els_clock_ready()) {
            cpu->r[0] = 1u;
            cpu->r[1] = 1u;
            romapi_return(cpu);
            return MM_TRUE;
        }
        romapi_nboot_set_true(map, cpu->sec_state, cpu->r[2]);
        cpu->r[0] = ROMAPI_NBOOT_SUCCESS;
        cpu->r[1] = 0u;
        romapi_return(cpu);
        return MM_TRUE;
    default:
        break;
    }
    return MM_FALSE;
}
